[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:118:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
+                !hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_MEMBER") && (
                   <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests not render RiderApplicationMember links for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/apply/rider">Apply to be a Rider</a> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:118:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                false
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
