[Killed] BlockStatement
main/components/Driver/DriverAvailabilityTable.js:66:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: DriverAvailabilityTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DriverAvailabilityTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:67:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "DriverAvailabilityTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
     } 
killedBy: DriverAvailabilityTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  Edit btn

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:68:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "DriverAvailabilityTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "DriverAvailabilityTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "DriverAvailabilityTable"));
     } 
 
killedBy: DriverAvailabilityTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  Delete btn
