[Timeout] BlockStatement
main/components/Nav/AppNavbar.js:15:31
   );
 }
 
-function hasChat(currentUser) {
-  return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-  );
-}
+function hasChat(currentUser) {}
 
 function createRideRequest(currentUser) {

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:17:5
 
 function hasChat(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_DRIVER")
   );
 }
killedBy: AppNavbar tests renders chat link correctly for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-chat-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:23:7
 }
 
 function createRideRequest(currentUser) {
-  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
+  if (true) {
     return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
   } else {
killedBy: AppNavbar tests Create ride should not be available for user that is a Driver and neither Admin nor Rider
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="dropdown-item" data-rr-ui-dropdown-item="" data-testid="appnavbar-ride-create-dropdown" href="/ride/create">Request Ride</a> instead

[Killed] ObjectLiteral
main/components/Nav/AppNavbar.js:31:18
 }
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
-  const styles = {
-    navbar: {
-      backgroundColor: "#003660",
-    }
-  }
+  const styles = {}
 
   return (
killedBy: AppNavbar tests background of AppNavbar is UCSB's navy color
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(0, 54, 96);

<html>
  <head />

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:40:10
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
+        (true) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Driver Dashboard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-driver-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:85:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Driver Dashboard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders correctly for regular logged in driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-driver-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:92:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:92:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:99:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-ride-dropdown-rides" as={Link} to="/ride/">Rides</NavDropdown.Item>
-                    {createRideRequest(currentUser)}
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:107:17
                 )
               }
               {
-                hasChat(currentUser) && (
-                  <NavDropdown title="Chat" id="appnavbar-chat-dropdown" data-testid="appnavbar-chat-dropdown" >
-                    <NavDropdown.Item as={Link} to="/chat">Chat</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders chat link correctly for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-chat-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:107:17
                 )
               }
               {
-                hasChat(currentUser) && (
-                  <NavDropdown title="Chat" id="appnavbar-chat-dropdown" data-testid="appnavbar-chat-dropdown" >
-                    <NavDropdown.Item as={Link} to="/chat">Chat</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasChat(currentUser) || <NavDropdown title="Chat" id="appnavbar-chat-dropdown" data-testid="appnavbar-chat-dropdown">
+                    <NavDropdown.Item as={Link} to="/chat">Chat</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders chat link correctly for driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-chat-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:114:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
-                )
+                isParticipant(currentUser) || <Nav.Link id="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
               }
               {
killedBy: AppNavbar tests renders driver page link for driver
statusReason: Error: Unable to find an element with the text: /Drivers/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:114:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders driver page link for driver
statusReason: Error: Unable to find an element with the text: /Drivers/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:119:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
-                  <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:119:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
+                true && (
                   <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests not render RiderApplicationMember links for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/apply/rider">Apply to be a Rider</a> instead
