[Killed] BlockStatement
src/main/components/OurTable.js:87:77
 //   ButtonColumn("Delete", "danger", deleteCallback)
 // ];
 
-export function ButtonColumn(label, variant, callback, testid, displayText) {
-  const column = {
-    Header: displayText || label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        className={cell.column.id} 
-      >
-        {displayText || label}
-      </Button>
-    )
-  }
-  return column;
-}
+export function ButtonColumn(label, variant, callback, testid, displayText) {}
killedBy: OurTable tests renders headers correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
src/main/components/OurTable.js:89:13
 
 export function ButtonColumn(label, variant, callback, testid, displayText) {
   const column = {
-    Header: displayText || label,
+    Header: true,
     id: label,
     Cell: ({ cell }) => (
killedBy: OurTable tests renders headers correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Click Here
Received:

[Killed] ConditionalExpression
src/main/components/OurTable.js:89:13
 
 export function ButtonColumn(label, variant, callback, testid, displayText) {
   const column = {
-    Header: displayText || label,
+    Header: false,
     id: label,
     Cell: ({ cell }) => (
killedBy: OurTable tests renders headers correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Click Here
Received:

[Timeout] ArrowFunction
src/main/components/OurTable.js:91:11
   const column = {
     Header: displayText || label,
     id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        className={cell.column.id} 
-      >
-        {displayText || label}
-      </Button>
-    )
+    Cell: () => undefined
   }
   return column;

[Killed] ConditionalExpression
src/main/components/OurTable.js:98:10
         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
         className={cell.column.id} 
       >
-        {displayText || label}
+        {true}
       </Button>
     )
killedBy: DriverAvailabilityTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Delete
Received:

[Killed] LogicalOperator
src/main/components/OurTable.js:98:10
         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
         className={cell.column.id} 
       >
-        {displayText || label}
+        {displayText && label}
       </Button>
     )
killedBy: DriverAvailabilityTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Delete
Received:
