[Killed] BooleanLiteral
main/components/Nav/AppNavbar.js:118:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
+                hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_MEMBER") && (
                   <Nav.Link as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:123:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <Nav.Link as={Link} to="/availability">Driver Availabilities</Nav.Link>
-                )
+                hasRole(currentUser, "ROLE_DRIVER") || <Nav.Link as={Link} to="/availability">Driver Availabilities</Nav.Link>
               }
 

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:123:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <Nav.Link as={Link} to="/availability">Driver Availabilities</Nav.Link>
-                )
+                true
               }
 
