[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:9:5
 
 function isParticipant(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
+    true
   );
 }
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-ride-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-ride-dropdown" role="button" tabindex="0">Ride Request</a></div> instead

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:124:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <Nav.Link as={Link} to="/availability">Driver Availabilities</Nav.Link>
-                )
+                false
               }
 
