[Killed] StringLiteral
main/components/Ride/RideTable.js:42:23
         },
         {
             Header: 'Student',
-            accessor: 'student',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-student"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:100:21
             accessor: 'course',
         },
         {
-            Header: 'Pick Up Time',
+            Header: "",
             accessor: 'startTime',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pick Up Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:115:9
             Header: 'Pick Up Room',
             accessor: 'pickupRoom',
         },
-        {
-            Header: 'Drop Off Building',
-            accessor: 'dropoffBuilding',
-        },
+        {},
         {
             Header: 'Drop Off Room',
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:119:9
             Header: 'Drop Off Building',
             accessor: 'dropoffBuilding',
         },
-        {
-            Header: 'Drop Off Room',
-            accessor: 'dropoffRoom',
-        },
+        {},
         {
             Header: 'Notes',
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:172:23
         },
         {
             Header: 'Notes',
-            accessor: 'notes',
+            accessor: "",
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-notes"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrayDeclaration
main/components/Ride/RideTable.js:183:32
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
 
-    const buttonColumnsAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
-    ]
+    const buttonColumnsAdmin = []
 
    
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
