[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:45:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.driverId?.message}
+                    {errors.driverId.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:52:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="day">Day</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-day"}
+                    data-testid={testIdPrefix + ""}
                     id="day"
                     type="text"
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:72:34
                     id="start"
                     type="text"
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", {
+                    {...register("", {
                         required: "start is required."
                     })}
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:72:43
                     id="start"
                     type="text"
                     isInvalid={Boolean(errors.start)}
-                    {...register("start", {
-                        required: "start is required."
-                    })}
+                    {...register("start", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:88:41
                     id="end"
                     type="text"
                     isInvalid={Boolean(errors.end)}
-                    {...register("end", {
-                        required: "end is required."
-                    })}
+                    {...register("end", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /end is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:100:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="notes">Notes</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-notes"}
+                    data-testid={testIdPrefix + ""}
                     id="notes"
                     type="text"
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-notes"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:104:43
                     id="notes"
                     type="text"
                     isInvalid={Boolean(errors.notes)}
-                    {...register("notes", {
-                        required: "notes is required."
-                    })}
+                    {...register("notes", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /notes is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:104:34
                     id="notes"
                     type="text"
                     isInvalid={Boolean(errors.notes)}
-                    {...register("notes", {
+                    {...register("", {
                         required: "notes is required."
                     })}
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:109:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.notes?.message}
+                    {errors.notes.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
