[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:17:36
     const testid = "RiderApplicationTable";
     const navigate = useNavigate();
 
-    const showCallback = (cell) => {
-        navigate(`/apply/rider/show/${cell.row.values.id}`)
-    }
+    const showCallback = (cell) => {}
     
     const editCallback = (cell) => {
killedBy: RiderApplicationTable tests Show button navigates to the show page for ordinary member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apply/rider/show/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:21:36
         navigate(`/apply/rider/show/${cell.row.values.id}`)
     }
     
-    const editCallback = (cell) => {
-        navigate(`/apply/rider/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const reviewCallback = (cell) => {
killedBy: RiderApplicationTable tests Edit button navigates to the edit page for ordinary member with a pending application
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apply/rider/edit/4"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:25:38
         navigate(`/apply/rider/edit/${cell.row.values.id}`)
     }
 
-    const reviewCallback = (cell) => {
-        navigate(`/admin/applications/riders/review/${cell.row.values.id}`)
-    }
+    const reviewCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RiderApplicationTable tests Review button navigates to the review page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/applications/riders/review/2"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationTable.js:43:13
     const cancelCallback = async (cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to cancel this application?\n\nClick 'OK' to confirm or 'Cancel' to keep your application active.");
-        if (confirmation)
+        if (true)
         {
             cancelMutation.mutate(cell); 
killedBy: RiderApplicationTable tests Cancel button calls cancelMutation for member with a pending application when the member cancels
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationTable.js:43:13
     const cancelCallback = async (cell) => { 
         const confirmation = window
                             .confirm("Are you sure you want to cancel this application?\n\nClick 'OK' to confirm or 'Cancel' to keep your application active.");
-        if (confirmation)
+        if (false)
         {
             cancelMutation.mutate(cell); 
killedBy: RiderApplicationIndexPage tests what happens when you click cancel and ok, member
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Application with id 4 is deleted"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:44:9
         const confirmation = window
                             .confirm("Are you sure you want to cancel this application?\n\nClick 'OK' to confirm or 'Cancel' to keep your application active.");
         if (confirmation)
-        {
-            cancelMutation.mutate(cell); 
-        }
+        {}
     }
 
killedBy: RiderApplicationTable tests Cancel button calls cancelMutation for member with a pending application when the member confirms
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
main/components/RiderApplication/RiderApplicationTable.js:50:9
     }
 
     const defaultColumns = [
-        {
-            Header: 'Application Id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'Date Applied',
killedBy: RiderApplicationIndexPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:55:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Date Applied',
+            Header: "",
             accessor: 'created_date',
         },
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Applied. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:64:23
         },
         {
             Header: 'Date Cancelled',
-            accessor: 'cancelled_date',
+            accessor: "",
         },
         {
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-0-col-cancelled_date"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:74:22
 
     const buttonColumnsMember = [
         ...defaultColumns,
-        ButtonColumn("Show", "primary", showCallback, "RiderApplicationTable"),
+        ButtonColumn("", "primary", showCallback, "RiderApplicationTable"),
         {
             Header: 'Edit',
killedBy: RiderApplicationTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:74:55
 
     const buttonColumnsMember = [
         ...defaultColumns,
-        ButtonColumn("Show", "primary", showCallback, "RiderApplicationTable"),
+        ButtonColumn("Show", "primary", showCallback, ""),
         {
             Header: 'Edit',
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-0-col-Show-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:77:33
         ButtonColumn("Show", "primary", showCallback, "RiderApplicationTable"),
         {
             Header: 'Edit',
-            Cell: ({ cell }) => {
-                if (cell.row.values.status === 'pending') {
-                    return (
-                        <Button
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                        variant = {"primary"} 
-                        onClick={() => editCallback(cell)}>Edit</Button>
-                    );
-                }
-                return null;
-            }
+            Cell: ({ cell }) => {}
         },
         {
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] EqualityOperator
main/components/RiderApplication/RiderApplicationTable.js:78:21
         {
             Header: 'Edit',
             Cell: ({ cell }) => {
-                if (cell.row.values.status === 'pending') {
+                if (cell.row.values.status !== 'pending') {
                     return (
                         <Button
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-2-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ConditionalExpression
main/components/RiderApplication/RiderApplicationTable.js:78:21
         {
             Header: 'Edit',
             Cell: ({ cell }) => {
-                if (cell.row.values.status === 'pending') {
+                if (false) {
                     return (
                         <Button
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-2-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:82:36
                     return (
                         <Button
                         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                        variant = {"primary"} 
+                        variant = {""} 
                         onClick={() => editCallback(cell)}>Edit</Button>
                     );
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] ArrowFunction
main/components/RiderApplication/RiderApplicationTable.js:83:34
                         <Button
                         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
                         variant = {"primary"} 
-                        onClick={() => editCallback(cell)}>Edit</Button>
+                        onClick={() => undefined}>Edit</Button>
                     );
                 }
killedBy: RiderApplicationTable tests Edit button navigates to the edit page for ordinary member with a pending application
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/apply/rider/edit/4"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:91:33
         },
         {
             Header: 'Cancel',
-            Cell: ({ cell }) => {
-                if (cell.row.values.status === 'pending') {
-                    return (
-                        <Button
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                        variant = {"danger"} 
-                        onClick={() => cancelCallback(cell)}>Cancel</Button>
-                    );
-                }
-                return null;
-            }
+            Cell: ({ cell }) => {}
         },
     ]
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/RiderApplication/RiderApplicationTable.js:92:59
         {
             Header: 'Cancel',
             Cell: ({ cell }) => {
-                if (cell.row.values.status === 'pending') {
-                    return (
-                        <Button
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                        variant = {"danger"} 
-                        onClick={() => cancelCallback(cell)}>Cancel</Button>
-                    );
-                }
+                if (cell.row.values.status === 'pending') {}
                 return null;
             }
killedBy: RiderApplicationIndexPage tests what happens when you click cancel and ok, member
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-2-col-Cancel-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/RiderApplication/RiderApplicationTable.js:97:34
                         <Button
                         data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
                         variant = {"danger"} 
-                        onClick={() => cancelCallback(cell)}>Cancel</Button>
+                        onClick={() => undefined}>Cancel</Button>
                     );
                 }
killedBy: RiderApplicationIndexPage tests what happens when you click cancel and ok, member
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to cancel this application?·
Click 'OK' to confirm or 'Cancel' to keep your application active."

Number of calls: 0

[Killed] ArrayDeclaration
main/components/RiderApplication/RiderApplicationTable.js:105:32
         },
     ]
 
-    const buttonColumnsAdmin = [
-        ...defaultColumns,
-        ButtonColumn("Review", "primary", reviewCallback, "RiderApplicationTable")
-
-    ];
+    const buttonColumnsAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN") ? buttonColumnsAdmin : buttonColumnsMember ;
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Application Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:107:32
 
     const buttonColumnsAdmin = [
         ...defaultColumns,
-        ButtonColumn("Review", "primary", reviewCallback, "RiderApplicationTable")
+        ButtonColumn("Review", "", reviewCallback, "RiderApplicationTable")
 
     ];
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  Review btn

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:111:51
 
     ];
 
-    const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN") ? buttonColumnsAdmin : buttonColumnsMember ;
+    const columnsToDisplay = hasRole(currentUser, "") ? buttonColumnsAdmin : buttonColumnsMember ;
     
     return <OurTable
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-0-col-Review-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
