[Killed] StringLiteral
main/pages/RiderApplication/RiderApplicationEditPageMember.js:18:14
       [`/api/riderApplication?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/riderApplication`,
+        url: ``,
         params: {
           id
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/RiderApplication/RiderApplicationEditPageMember.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (riderApplication) => ({
-    url: "/api/riderApplication",
-    method: "PUT",
-    params: {
-      id: riderApplication.id,
-    },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationEditPageMember.js:26:57
     );
 
 
-  const objectToAxiosPutParams = (riderApplication) => ({
-    url: "/api/riderApplication",
-    method: "PUT",
-    params: {
-      id: riderApplication.id,
-    },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description
-    }
-  });
+  const objectToAxiosPutParams = (riderApplication) => ({});
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationEditPageMember.js:29:13
   const objectToAxiosPutParams = (riderApplication) => ({
     url: "/api/riderApplication",
     method: "PUT",
-    params: {
-      id: riderApplication.id,
-    },
+    params: {},
     data: {
         perm_number: riderApplication.perm_number,
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationEditPageMember.js:32:11
     params: {
       id: riderApplication.id,
     },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description
-    }
+    data: {}
   });
 
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"perm_number\":\"7654321\",\"description\":\"I broke my leg.\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationEditPageMember.js:38:43
     }
   });
 
-  const onSuccess = (riderApplication) => {
-    toast(`Application Updated - id: ${riderApplication.id}`);
-  }
+  const onSuccess = (riderApplication) => {}
 
   const mutation = useBackendMutation(
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/RiderApplication/RiderApplicationEditPageMember.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" disableBool={false} />
+                {riderApplication || <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" disableBool={false} />
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationEditPageMember.js:63:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" disableBool={false} />
+                {false
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
main/pages/RiderApplication/RiderApplicationEditPageMember.js:64:130
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
                 {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" disableBool={false} />
+                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" disableBool={true} />
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
