[Killed] StringLiteral
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:18:18
          [`/api/rider/admin?id=${id}`],
          {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
             method: "GET",
-            url: `/api/rider/admin`,
+            url: ``,
             params: {
                id
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:25:35
          }
       );
 
-   const objectToAxiosPutParams = (riderApplication) => ({
-
-      url: "/api/rider/admin",
-      method: "PUT",
-      params: {
-         id: riderApplication.id,
-         status: riderApplication.status,
-         notes: riderApplication.notes
-      }
-
-   });
+   const objectToAxiosPutParams = () => undefined;
 
 
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:28:15
    const objectToAxiosPutParams = (riderApplication) => ({
 
       url: "/api/rider/admin",
-      method: "PUT",
+      method: "",
       params: {
          id: riderApplication.id,
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:29:15
 
       url: "/api/rider/admin",
       method: "PUT",
-      params: {
-         id: riderApplication.id,
-         status: riderApplication.status,
-         notes: riderApplication.notes
-      }
+      params: {}
 
    });
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "id": 17,
-   "notes": "notes inserted",

[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:51:37
 
    const { isSuccess } = mutation
 
-   const onSubmit = async (data) => {
-      mutation.mutate(data)
-   }
+   const onSubmit = async (data) => {}
 
    if (isSuccess) {
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:55:19
       mutation.mutate(data)
    }
 
-   if (isSuccess) {
-      return <Navigate to="/admin/applications/riders" />
-   }
+   if (isSuccess) {}
 
    return (
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/applications/riders"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:63:14
       <BasicLayout>
          <div className="pt-2">
             <h1>Review Rider Application</h1>
-            {riderApplication &&
-               <RiderApplicationForm initialContents={riderApplication} buttonLabel="Review" disableBool={false} submitAction={onSubmit} />
+            {riderApplication || <RiderApplicationForm initialContents={riderApplication} buttonLabel="Review" disableBool={false} submitAction={onSubmit} />
             }
          </div>
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:63:14
       <BasicLayout>
          <div className="pt-2">
             <h1>Review Rider Application</h1>
-            {riderApplication &&
-               <RiderApplicationForm initialContents={riderApplication} buttonLabel="Review" disableBool={false} submitAction={onSubmit} />
+            {false
             }
          </div>
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BooleanLiteral
main/pages/RiderApplication/RiderApplicationReviewPageAdmin.js:64:107
          <div className="pt-2">
             <h1>Review Rider Application</h1>
             {riderApplication &&
-               <RiderApplicationForm initialContents={riderApplication} buttonLabel="Review" disableBool={false} submitAction={onSubmit} />
+               <RiderApplicationForm initialContents={riderApplication} buttonLabel="Review" disableBool={true} submitAction={onSubmit} />
             }
          </div>
killedBy: RiderApplicationReviewPage tests tests where backend is working normally Changes when you click Review
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "id": 17,
-   "notes": "notes inserted",
