[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationShowPageMember.js:16:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/riderApplication?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/riderApplication`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationShowPageMember.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Show Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} buttonLabel="show" disableBool={true} />
+                {true
                 }
             </div>
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/RiderApplication/RiderApplicationShowPageMember.js:31:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Show Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} buttonLabel="show" disableBool={true} />
+                {riderApplication || <RiderApplicationForm initialContents={riderApplication} buttonLabel="show" disableBool={true} />
                 }
             </div>
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/pages/RiderApplication/RiderApplicationShowPageMember.js:32:106
             <div className="pt-2">
                 <h1>Show Rider Application</h1>
                 {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} buttonLabel="show" disableBool={true} />
+                <RiderApplicationForm initialContents={riderApplication} buttonLabel="show" disableBool={false} />
                 }
             </div>
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <input class="form-control" data-testid="RiderApplicationForm-perm_number" id="perm_number" name="perm_number" placeholder="e.g. 0000000" type="text" value="1234567" />
