[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:74:55
 
     const buttonColumnsMember = [
         ...defaultColumns,
-        ButtonColumn("Show", "primary", showCallback, "RiderApplicationTable", "Show"),
+        ButtonColumn("Show", "primary", showCallback, "", "Show"),
         {
             Header: 'Edit',
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RiderApplicationTable-cell-row-0-col-Show-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:74:30
 
     const buttonColumnsMember = [
         ...defaultColumns,
-        ButtonColumn("Show", "primary", showCallback, "RiderApplicationTable", "Show"),
+        ButtonColumn("Show", "", showCallback, "RiderApplicationTable", "Show"),
         {
             Header: 'Edit',
killedBy: RiderApplicationTable tests Has the expected column headers and content for ordinary member
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  Show btn

[Killed] ArrayDeclaration
main/components/RiderApplication/RiderApplicationTable.js:105:32
         },
     ]
 
-    const buttonColumnsAdmin = [
-        ...defaultColumns,
-        ButtonColumn("Review", "primary", reviewCallback, "RiderApplicationTable", "Review")
-
-    ];
+    const buttonColumnsAdmin = [];
 
     console.log("Current user roles:", currentUser?.roles);
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Application Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:107:32
 
     const buttonColumnsAdmin = [
         ...defaultColumns,
-        ButtonColumn("Review", "primary", reviewCallback, "RiderApplicationTable", "Review")
+        ButtonColumn("Review", "", reviewCallback, "RiderApplicationTable", "Review")
 
     ];
killedBy: RiderApplicationTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  Review btn

[Killed] OptionalChaining
main/components/RiderApplication/RiderApplicationTable.js:111:40
 
     ];
 
-    console.log("Current user roles:", currentUser?.roles);
+    console.log("Current user roles:", currentUser.roles);
     console.log("Is Admin:", hasRole(currentUser, "ROLE_ADMIN"));
 
killedBy: RiderApplicationTable tests renders without crashing for empty table with user not logged in
statusReason: TypeError: Cannot read properties of null (reading 'roles')

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:111:17
 
     ];
 
-    console.log("Current user roles:", currentUser?.roles);
+    console.log("", currentUser?.roles);
     console.log("Is Admin:", hasRole(currentUser, "ROLE_ADMIN"));
 

[Survived] StringLiteral
main/components/RiderApplication/RiderApplicationTable.js:112:51
     ];
 
     console.log("Current user roles:", currentUser?.roles);
-    console.log("Is Admin:", hasRole(currentUser, "ROLE_ADMIN"));
+    console.log("Is Admin:", hasRole(currentUser, ""));
 
     const columnsToDisplay = hasRole(currentUser, "ROLE_ADMIN") ? buttonColumnsAdmin : buttonColumnsMember ;
