[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityCreatePage.js:9:33
 
 export default function DriverAvailabilityCreatePage() {
 
-    const objectToAxiosParams = (driverAvailability) => ({
-        url: "/api/driverAvailability/new",
-        method: "POST",
-        params: {
-            driverId: driverAvailability.driverId,
-            day: driverAvailability.day,
-            startTime: driverAvailability.start,
-            endTime: driverAvailability.end,
-            notes: driverAvailability.notes
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Drivers/DriverAvailabilityCreatePage.js:10:14
 export default function DriverAvailabilityCreatePage() {
 
     const objectToAxiosParams = (driverAvailability) => ({
-        url: "/api/driverAvailability/new",
+        url: "",
         method: "POST",
         params: {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Driver Availability Created - id: 17"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Drivers/DriverAvailabilityCreatePage.js:12:17
     const objectToAxiosParams = (driverAvailability) => ({
         url: "/api/driverAvailability/new",
         method: "POST",
-        params: {
-            driverId: driverAvailability.driverId,
-            day: driverAvailability.day,
-            startTime: driverAvailability.start,
-            endTime: driverAvailability.end,
-            notes: driverAvailability.notes
-        }
+        params: {}
     });
 
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "day": "Monday",
-   "driverId": "5",

[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityCreatePage.js:21:47
         }
     });
 
-    const onSuccess = (driverAvailability) => {
-        toast(`New Driver Availability Created - id: ${driverAvailability.id}`);
-    }
+    const onSuccess = (driverAvailability) => {}
 
     const mutation = useBackendMutation(
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Driver Availability Created - id: 17"

Number of calls: 0
