[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:72:34
                     id="start"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("start", {
+                    {...register("", {
                         required: "start is required."
                     })}
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:72:43
                     id="start"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("start", {
-                        required: "start is required."
-                    })}
+                    {...register("start", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:88:41
                     id="end"
                     type="text"
                     isInvalid={Boolean(errors.endTime)}
-                    {...register("end", {
-                        required: "end is required."
-                    })}
+                    {...register("end", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /end is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
