[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (driverAvailability) => ({
-    url: "/api/driverAvailability",
-    method: "PUT",
-    params: {
-      id: driverAvailability.id,
-    },
-    data: {
-        driverId: driverAvailability.driverId,
-        day: driverAvailability.day,
-        startTime: driverAvailability.start,
-        endTime: driverAvailability.end, 
-        notes: driverAvailability.notes,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
