[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:72:47
                     id="start"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("startTime", {
-                        required: "start is required."
-                    })}
+                    {...register("startTime", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:88:45
                     id="end"
                     type="text"
                     isInvalid={Boolean(errors.endTime)}
-                    {...register("endTime", {
-                        required: "end is required."
-                    })}
+                    {...register("endTime", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests Correct Errors on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /end is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
