[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityCreatePage.js:9:33
 
 export default function DriverAvailabilityCreatePage() {
 
-    const objectToAxiosParams = (driverAvailability) => ({
-        url: "/api/driverAvailability/new",
-        method: "POST",
-        params: {
-            driverId: driverAvailability.driverId,
-            day: driverAvailability.day,
-            startTime: driverAvailability.startTime,
-            endTime: driverAvailability.endTime,
-            notes: driverAvailability.notes
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
