[Killed] StringLiteral
main/pages/Drivers/DriverAvailabilityEditPage.js:18:14
       [`/api/driverAvailability?id=${id}`],
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: `/api/driverAvailability`,
+        url: ``,
         params: {
           id
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-driverId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Drivers/DriverAvailabilityEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (driverAvailability) => ({
-    url: "/api/driverAvailability",
-    method: "PUT",
-    params: {
-      id: driverAvailability.id,
-    },
-    data: {
-        driverId: driverAvailability.driverId,
-        day: driverAvailability.day,
-        startTime: driverAvailability.startTime,
-        endTime: driverAvailability.endTime, 
-        notes: driverAvailability.notes,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Drivers/DriverAvailabilityEditPage.js:27:10
 
 
   const objectToAxiosPutParams = (driverAvailability) => ({
-    url: "/api/driverAvailability",
+    url: "",
     method: "PUT",
     params: {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Drivers/DriverAvailabilityEditPage.js:29:13
   const objectToAxiosPutParams = (driverAvailability) => ({
     url: "/api/driverAvailability",
     method: "PUT",
-    params: {
-      id: driverAvailability.id,
-    },
+    params: {},
     data: {
         driverId: driverAvailability.driverId,
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityEditPage.js:58:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/availability/" />
-  }
+  if (isSuccess) {}
 
     return (
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/availability/"}

Number of calls: 0
